In [1]:
import pandas as pd
df = pd.read_csv("natural_disasters.csv")

In [2]:
df.head()

,Disaster_ID,Disaster_Type,Location,Magnitude,Date,Fatalities,Economic_Loss_in_Million_$,Buildings collapsed,probability
0,1,Wildfire,Brazil,6.267393,1999.0,3.0,455,NaN,NaN
1,2,Hurricane,Indonesia,6.649358,2019.0,0.0,873,NaN,NaN
2,3,Tornado,China,9.724366,2011.0,23.0,1058,NaN,NaN
3,4,Flood,India,1.702505,2005.0,5.0,231,NaN,NaN
4,5,Flood,Brazil,7.917748,2010.0,28.0,966,NaN,NaN

In [3]:
df.shape

(10009, 9)

In [4]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10009 entries, 0 to 10008
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Disaster_ID                 10009 non-null  int64
 1   Disaster_Type               10009 non-null  str
 2   Location                    10009 non-null  str
 3   Magnitude                   10009 non-null  float64
 4   Date                        10007 non-null  float64
 5   Fatalities                  10008 non-null  float64
 6   Economic_Loss_in_Million_$  10009 non-null  int64
 7   Buildings collapsed         0 non-null      float64
 8   probability                 0 non-null      float64
dtypes: float64(5), int64(2), str(2)
memory usage: 703.9 KB

In [5]:
df.describe()

,Disaster_ID,Magnitude,Date,Fatalities,Economic_Loss_in_Million_$,Buildings collapsed,probability
count,10009.000000,10009.000000,10007.000000,10008.000000,10009.000000,0.0,0.0
mean,5004.997902,5.218205,2004.571600,5.257394,713.410730,NaN,NaN
std,2889.490125,2.567631,8.658145,10.447377,514.468762,NaN,NaN
min,1.000000,0.710736,1990.000000,0.000000,32.000000,NaN,NaN
25%,2503.000000,2.993240,1997.000000,0.000000,334.000000,NaN,NaN
50%,5005.000000,5.142685,2004.000000,1.000000,590.000000,NaN,NaN
75%,7507.000000,7.303426,2012.000000,2.000000,946.000000,NaN,NaN
max,10006.000000,9.999671,2019.000000,40.000000,3895.000000,NaN,NaN

In [9]:
df = df[["Disaster_ID","Disaster_Type","Location","Magnitude","Date",	"Fatalities","Economic_Loss_in_Million_$"]]

In [10]:
df.head()

,Disaster_ID,Disaster_Type,Location,Magnitude,Date,Fatalities,Economic_Loss_in_Million_$
0,1,Wildfire,Brazil,6.267393,1999.0,3.0,455
1,2,Hurricane,Indonesia,6.649358,2019.0,0.0,873
2,3,Tornado,China,9.724366,2011.0,23.0,1058
3,4,Flood,India,1.702505,2005.0,5.0,231
4,5,Flood,Brazil,7.917748,2010.0,28.0,966

In [17]:
df.groupby("Disaster_Type")["Fatalities"].sum().sort_values(ascending = False)

Disaster_Type
Tornado       13175.0
Flood         13043.0
Wildfire      12347.0
Hurricane     11754.0
Earthquake     2297.0
cyclone           0.0
Name: Fatalities, dtype: float64

In [18]:
df.groupby("Disaster_Type")["Economic_Loss_in_Million_$"].sum().sort_values(ascending = False)

Disaster_Type
Hurricane     1985214
Earthquake    1599850
Flood         1483237
Wildfire      1174649
Tornado        896496
cyclone          1082
Name: Economic_Loss_in_Million_$, dtype: int64

In [20]:
import matplotlib.pyplot as plt
x = df["Disaster_Type"].unique()
y = df.groupby("Disaster_Type")["Fatalities"].sum()
x
#plt.bar()

<StringArray>
['Wildfire', 'Hurricane', 'Tornado', 'Flood', 'Earthquake', 'cyclone']
Length: 6, dtype: str